================================================================================
Entry with two fields
================================================================================

@article{foo, author = {Foo Bar}, title = {Baz Qux}}

--------------------------------------------------------------------------------

(source_file
  (entry
    (entry_type)
    (key)
    (field
      (identifier)
      (value
        (curly_group
          (word)
          (word))))
    (field
      (identifier)
      (value
        (curly_group
          (word)
          (word))))))

================================================================================
Entry with trailing comma
================================================================================

@article{foo, author = {Foo Bar}, title = {Baz Qux},}

--------------------------------------------------------------------------------

(source_file
  (entry
    (entry_type)
    (key)
    (field
      (identifier)
      (value
        (curly_group
          (word)
          (word))))
    (field
      (identifier)
      (value
        (curly_group
          (word)
          (word))))))

================================================================================
Entry without fields
================================================================================

@article{foo,}

--------------------------------------------------------------------------------

(source_file
  (entry
    (entry_type)
    (key)))

================================================================================
Entry with integer field
================================================================================

@article{foo, year = 2021}

--------------------------------------------------------------------------------

(source_file
  (entry
    (entry_type)
    (key)
    (field
      (identifier)
      (value
        (integer)))))

================================================================================
Entry with junk
================================================================================

Foo Bar

@article{foo,}

--------------------------------------------------------------------------------

(source_file
  (junk)
  (junk)
  (entry
    (entry_type)
    (key)))

================================================================================
Entry with inline formulas
================================================================================

@article{foo, title = {Foo $Bar$ Baz $Qux$}}

--------------------------------------------------------------------------------

(source_file
  (entry
    (entry_type)
    (key)
    (field
      (identifier)
      (value
        (curly_group
          (word)
          (inline_formula
            (word))
          (word)
          (inline_formula
            (word)))))))
